In [26]:
from ravenclaw.wrangling import get_closest_match, fuzzy_join
import pandas as pd
df1 = pd.DataFrame({'ticker': [1,2,3,4], 'company': ['amazon inc', 'apple inc', 'google', 'goog']})
df2 = pd.DataFrame({'name': ['google', 'amazon', 'mapple inc', 'apple'], 'revenue':[1000, 2000, 3000, 4000]})

In [27]:
df1

      company  ticker
0  amazon inc       1
1   apple inc       2
2      google       3
3        goog       4

In [28]:
df2

         name  revenue
0      google     1000
1      amazon     2000
2  mapple inc     3000
3       apple     4000

In [29]:
fuzzy_join(left=df1, right=df2, left_on='company', right_on='name', how='left', allow_duplicates=True, score_col='score')

      company  ticker     score        name  revenue
0  amazon inc       1  0.920000      amazon     2000
1   apple inc       2  0.966667  mapple inc     3000
2      google       3  1.000000      google     1000
3        goog       4  0.933333      google     1000

In [23]:
fuzzy_join(left=df1, right=df2, left_on='company', right_on='name', how='left', allow_duplicates=False, score_col='score')

      company  ticker     score    name  revenue
0  amazon inc       1  0.920000  amazon   2000.0
1   apple inc       2  0.911111   apple   4000.0
2      google       3  1.000000  google   1000.0
3        goog       4       NaN     NaN      NaN